In [47]:
import pandas as pd
import numpy as np

In [48]:
dados = [10, 20, 30]
print(dados)

[10, 20, 30]

In [49]:
serie = pd.Series(dados)
print(serie)

0    10
1    20
2    30
dtype: int64

In [52]:
dados = {
    "Nome": ["Maria", "Joana", "José", "Pedro", "Paulo", "João", "Marcelo"],
    "Idade": [30, 40, 50, 12, 60, 71, np.nan],
    "Cidade": ["Joinville", "São Paulo", "Rio de Janeiro", "Curitiba", "Joinville", "Curitiba", np.nan],
    "Salário": [3_500.00, 9_000.00, 4_350.00, 15_000.00, 1_650.00, 6_000.00, 0]
}
#print(dados)

df = pd.DataFrame(dados)
print(df)

      Nome  Idade          Cidade  Salário
0    Maria   30.0       Joinville   3500.0
1    Joana   40.0       São Paulo   9000.0
2     José   50.0  Rio de Janeiro   4350.0
3    Pedro   12.0        Curitiba  15000.0
4    Paulo   60.0       Joinville   1650.0
5     João   71.0        Curitiba   6000.0
6  Marcelo    NaN             NaN      0.0

In [66]:
#df.tail()
df.head()

    Nome  Idade          Cidade  Salário
0  Maria   30.0       Joinville   3500.0
1  Joana   40.0       São Paulo   9000.0
2   José   50.0  Rio de Janeiro   4350.0
3  Pedro   12.0        Curitiba  15000.0
4  Paulo   60.0       Joinville   1650.0

In [65]:
#df.shape
df.columns
df.dtypes

Nome        object
Idade      float64
Cidade      object
Salário    float64
dtype: object

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     7 non-null      object
 1   Idade    6 non-null      float64
 2   Cidade   6 non-null      object
 3   Salário  7 non-null      float64
dtypes: float64(2), object(2)
memory usage: 356.0+ bytes

In [56]:
df.describe()

           Idade       Salário
count   6.000000      7.000000
mean   43.833333   5642.857143
std    21.245392   5049.787831
min    12.000000      0.000000
25%    32.500000   2575.000000
50%    45.000000   4350.000000
75%    57.500000   7500.000000
max    71.000000  15000.000000

In [80]:
df['Salário']
df.iloc[1]
df.iloc[1, 2]
#df.iloc[1:3]

'São Paulo'

In [92]:
df.loc[:,"Nome"]

0      Maria
1      Joana
2       José
3      Pedro
4      Paulo
5       João
6    Marcelo
Name: Nome, dtype: object

In [87]:
df.iloc[:, :3]

      Nome  Idade          Cidade
0    Maria   30.0       Joinville
1    Joana   40.0       São Paulo
2     José   50.0  Rio de Janeiro
3    Pedro   12.0        Curitiba
4    Paulo   60.0       Joinville
5     João   71.0        Curitiba
6  Marcelo    NaN             NaN

In [100]:
df.loc[df["Idade"] > 30, ["Nome", "Cidade"]]

    Nome          Cidade
1  Joana       São Paulo
2   José  Rio de Janeiro
4  Paulo       Joinville
5   João        Curitiba

In [101]:
df[df['Idade'] > 30][['Nome', 'Cidade']]

    Nome          Cidade
1  Joana       São Paulo
2   José  Rio de Janeiro
4  Paulo       Joinville
5   João        Curitiba

In [108]:
df[:][["Nome", "Cidade"]]

      Nome          Cidade
0    Maria       Joinville
1    Joana       São Paulo
2     José  Rio de Janeiro
3    Pedro        Curitiba
4    Paulo       Joinville
5     João        Curitiba
6  Marcelo             NaN

In [111]:
df.isnull()

    Nome  Idade  Cidade  Salário
0  False  False   False    False
1  False  False   False    False
2  False  False   False    False
3  False  False   False    False
4  False  False   False    False
5  False  False   False    False
6  False   True    True    False